[
  {
    "state": "Unsold",
    "_id": "67ca7cb31784a81a9879b6f8",
    "title": "Sportneer Pull Up Bar: Strength Training Chin up Bar",
    "description": "About this item\r\nBefore purchasing, ensure your door frame width is between 29.5-37 inches (75 to 94 cm). This chin up bar is not suitable for frames outside this range. The door frame must be wider than the anti-slip pads at both ends of the bar\r\nTo ensure safety, the manual specifies a maximum load of 297 lbs (135 kg). Testing shows the product can handle up to 744 lbs (337.5 kg) of instantaneous load, meeting a 2.5x safety factor. However, the pull up bar's capacity also depends on the usage environment. Users should strictly adhere to the 135 kg limit\r\nNo Drilling, No Traces: The pull-up bar uses innovative fixative technology to stay in place. It features two large 6.5 x 1.8-inch PVC mats for added friction and stability. Four metal fixed points connect the base and bar, ensuring a secure, fall-proof design even under heavy loads\r\nHeavy Duty Construction: Our Pull Up Bar supports up to 440 lbs (200 kg) with its 2 mm outer and 1.5 mm inner steel pipes. This pull-up bar built to last without deforming or breaking, ensuring durability for your home gym. Note: Longer use distances may reduce the load of chin-up bar\r\nUpgraded Mechanic Lock System: This push-up bar features a new 360-degree rotatable dual gear lock on both ends to protect the bar from loosening. The doorway exercise bar has passed extensive testing, ensuring safety and sturdiness for confident use\r\nEasy Installation: Install quickly with detailed instructions, a video guide, and arrow markers on the chin-up bar. Spirit levels on both ends ensure correct setup. Ensure your doorway or wall is solid; avoid ceramic tiles, glass or non-solid doorframe. Note: Verify the marked rotation direction; reversing it may cause locking\r\nIntegrated, Extensible Structure: Unlike most 2-section foam bars, this doorway pull up bar features an ultra long, integrated anti-slip cotton handlebar for a flexible grip. It's sweat-resistant, odorless, and durable. Twist the bar to adjust its length from 29.5 to 37 inches (75 to 94 cm) for various workouts like pull-ups, sit-ups, push-ups, stretching and more",
    "price": 599,
    "category": "67bc4877c22bd886eecf5fbb",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741323140/ne9jcf3hmys66p4yvuwg.jpg",
    "createdAt": "2025-03-07T04:57:23.859Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca7cbb1784a81a9879b723",
    "title": "Sportneer Pull Up Bar: Strength Training Chin up Bar",
    "description": "About this item\r\nBefore purchasing, ensure your door frame width is between 29.5-37 inches (75 to 94 cm). This chin up bar is not suitable for frames outside this range. The door frame must be wider than the anti-slip pads at both ends of the bar\r\nTo ensure safety, the manual specifies a maximum load of 297 lbs (135 kg). Testing shows the product can handle up to 744 lbs (337.5 kg) of instantaneous load, meeting a 2.5x safety factor. However, the pull up bar's capacity also depends on the usage environment. Users should strictly adhere to the 135 kg limit\r\nNo Drilling, No Traces: The pull-up bar uses innovative fixative technology to stay in place. It features two large 6.5 x 1.8-inch PVC mats for added friction and stability. Four metal fixed points connect the base and bar, ensuring a secure, fall-proof design even under heavy loads\r\nHeavy Duty Construction: Our Pull Up Bar supports up to 440 lbs (200 kg) with its 2 mm outer and 1.5 mm inner steel pipes. This pull-up bar built to last without deforming or breaking, ensuring durability for your home gym. Note: Longer use distances may reduce the load of chin-up bar\r\nUpgraded Mechanic Lock System: This push-up bar features a new 360-degree rotatable dual gear lock on both ends to protect the bar from loosening. The doorway exercise bar has passed extensive testing, ensuring safety and sturdiness for confident use\r\nEasy Installation: Install quickly with detailed instructions, a video guide, and arrow markers on the chin-up bar. Spirit levels on both ends ensure correct setup. Ensure your doorway or wall is solid; avoid ceramic tiles, glass or non-solid doorframe. Note: Verify the marked rotation direction; reversing it may cause locking\r\nIntegrated, Extensible Structure: Unlike most 2-section foam bars, this doorway pull up bar features an ultra long, integrated anti-slip cotton handlebar for a flexible grip. It's sweat-resistant, odorless, and durable. Twist the bar to adjust its length from 29.5 to 37 inches (75 to 94 cm) for various workouts like pull-ups, sit-ups, push-ups, stretching and more",
    "price": 599,
    "category": "67bc4877c22bd886eecf5fbb",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741323140/ne9jcf3hmys66p4yvuwg.jpg",
    "createdAt": "2025-03-07T04:57:31.239Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca7de7dd752810881c1047",
    "title": "a",
    "description": "sdsds",
    "price": 11,
    "category": "67bc4877c22bd886eecf5fa0",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741270788/swgvlhrirjjbbazlkwqn.webp",
    "createdAt": "2025-03-07T05:02:31.107Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca7fe17218570bc07238af",
    "title": "Harry Potter",
    "description": "Best Fiction Book",
    "price": 350,
    "category": "67bc4877c22bd886eecf5fa0",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741322503/zg1viodij26wmhfriuo4.jpg",
    "createdAt": "2025-03-07T05:10:57.021Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca809a7218570bc07239a8",
    "title": "Bat",
    "description": "English villa bat",
    "price": 250,
    "category": "67bc4877c22bd886eecf5fbe",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741322949/szeguccsfvjhhsfmdaij.jpg",
    "createdAt": "2025-03-07T05:14:02.186Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca80b71784a81a9879ba49",
    "title": "The Alchemist",
    "description": "Paulo Coelho's enchanting novel has inspired a devoted following around the world. This story, dazzling in its simplicity and wisdom, is about an Andalusian shepherd boy named Santiago who travels from his homeland in Spain to the Egyptian desert in search of treasure buried in the Pyramids. Along the way he meets a Gypsy woman, a man who calls himself king, and an Alchemist, all of whom point Santiago in the direction of his quest. No one knows what the treasure is, or if Santiago will be able to surmount the obstacles along the way But what starts out as a journey to find worldly goods turns into a meditation on the treasures found within. Lush, evocative, and deeply humane, the story of Santiago is art eternal testament to the transforming power of our dreams and the importance of listening to our hearts.\r\n©1988 Paulo Coelho (P)2005 HarperCollins Publishers",
    "price": 258,
    "category": "67bc4877c22bd886eecf5fa0",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741324382/ycmqz6ocqakzin8h59dl.jpg",
    "createdAt": "2025-03-07T05:14:31.818Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca80bb1784a81a9879ba67",
    "title": "The Alchemist",
    "description": "Paulo Coelho's enchanting novel has inspired a devoted following around the world. This story, dazzling in its simplicity and wisdom, is about an Andalusian shepherd boy named Santiago who travels from his homeland in Spain to the Egyptian desert in search of treasure buried in the Pyramids. Along the way he meets a Gypsy woman, a man who calls himself king, and an Alchemist, all of whom point Santiago in the direction of his quest. No one knows what the treasure is, or if Santiago will be able to surmount the obstacles along the way But what starts out as a journey to find worldly goods turns into a meditation on the treasures found within. Lush, evocative, and deeply humane, the story of Santiago is art eternal testament to the transforming power of our dreams and the importance of listening to our hearts.\r\n©1988 Paulo Coelho (P)2005 HarperCollins Publishers",
    "price": 258,
    "category": "67bc4877c22bd886eecf5fa0",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741324382/ycmqz6ocqakzin8h59dl.jpg",
    "createdAt": "2025-03-07T05:14:35.021Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca815c2552b08d1025e6a4",
    "title": "Boldfit Resistance Tube with Foam Handles",
    "description": "Abundant Quantity: these exercise bands with handles come in a set of 10; With 5 vibrant colors in yellow, red, green, blue, black, our resistance bands are not just attractive but practical as well; Each color represents a different resistance level, making it easier for you to select the suitable one for your workouts and track your progress\r\n5 Resistance Levels: these resistance bands come in different resistance levels, such as 5-10lb (yellow), 15-20lb (red), 20-25lb (green), 25-30lb (blue) and 35-50lb (black); No matter your current fitness level, these bands can be applied for a variety of exercises and target different muscle groups, well trained to each of your muscles, so you can get a full body workout\r\nReliable and Long Lasting: constructed from quality latex tubes, the bands for working out are stable, long lasting, difficult to break or rust, and easy to use, offering good resilience and longevity; These bands are designed to maintain their elasticity and effectiveness even after frequent use; The resistance band has two foam handles that are soft, pleasant, and easy to hold; This makes for a good user experience",
    "price": 1099,
    "category": "67bc4877c22bd886eecf5fbb",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741323809/qciqkn6c5nlopdscnscq.jpg",
    "createdAt": "2025-03-07T05:17:16.613Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca81a954a7c92315b1f351",
    "title": "The Science of Self-Discipline",
    "description": "Your best intentions are not enough. Learn how to scientifically engineer a disciplined existence, become relentless, and never give up.\r\n\r\nWhatever you want in your life, self-discipline is the missing piece. Goals will remain dreams if you make the mistake of relying on motivation and your best drawn plans.\r\n\r\nThe Science of Self-Discipline is a deep look into what allows us to resist our worst impulses and simply execute, achieve, produce, and focus. Every principle is scientifically-driven and dissected to as be actionable and helpful as possible. You'll learn how top performers consistently exercise self-discipline, as well as what drives us on an instinctual, psychological level to act.\r\n\r\nThis isn't just a book; it's a roadmap to the human psyche and will allow you to accomplish exactly what you set out to do, every time. When you understand what drives your cravings and the true roots of self-discipline, you'll be able to rise above your temporary discomfort and focus on what really matters. Discover every factor that impacts self-discipline for better or worse.\r\n\r\nBreak free of excuses, distractions, laziness, and temptations.\r\n\r\nPeter Hollins has studied psychology and peak human performance for over a dozen years and is a best-selling author. He has worked with dozens of individuals to unlock their potential and path towards success. His writing draws on his academic, coaching, and research experience.\r\n\r\nBeat instant gratification and create limitless motivation\r\nThe biological basis of self-discipline - and why it's beneficial to you\r\nDiscipline tactics for high performers such as Navy SEALs\r\nDiagnosing what motivates you, what drains you, and what moves you emotionally\r\nEngineering an environment and social circle that boosts self-discipline\r\nRead less\r\n©2017 Peter Hollins (P)2017 Peter Hollins",
    "price": 260,
    "category": "67bc4877c22bd886eecf5fa1",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741324149/br9oyev1bm6lgi8tykvi.jpg",
    "createdAt": "2025-03-07T05:18:33.964Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca822054a7c92315b1f418",
    "title": "BULLAR Home Gym Set",
    "description": "About this item\r\n【4 in 1 Multifunctional Dumbbell Set】With it, you can get a pair of dumbbells also barbells, kettlebells, and push-up stands, which help you do many exercises including bench presses, squats, etc.\r\n【Durable Materials】Environmentally dumbbell pieces exterior is made of high-quality PE materials, and the inside is mixed with iron, mud, and sand, which effectively prevents floor abrasion.\r\n【20MM Thickened Foam】The connecting rod is made of a 5mm thick steel tube + 20mm thick high-quality foam. Curved design fits the neck, which is non-slip and sweat-absorbing, soft and breathable, bringing a more comfortable exercise experience to you.\r\n【Non-slip Dumbbell Bar】The surface of the dumbbell bar is made of ABS environmentally material and attached to a non-slip texture, which strengthens the friction of the hand and helps you control the dumbbell better during exercise.\r\n【Safety Nuts】The sets contain four safety nuts. Nut thread thickening effectively keeps the dumbbell piece solid, to prevent movement shaking. Ensure your safety in use.\r\n【More Weight Options】The dumbbell pieces feature a detachable design, and the adjustable weight range for the single dumbbell is 6lbs-22.5lbs, which meets your exercise intensity needs in different stages. Installation is easy.\r\n【Brand Support】FEIERDUN always due to providing our customers with the best service. If our product could not meet your expectations, please feel free to contact us, we will respond within 12 hours.",
    "price": 2019,
    "category": "67bc4877c22bd886eecf5fbb",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741323992/frxnbvpmowweybf6lxps.jpg",
    "createdAt": "2025-03-07T05:20:32.090Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67ca82d154a7c92315b1f544",
    "title": "iQOO 13 5G",
    "description": "PERFORMACE: The fastest processor ever powered by Snapdragon 8 Elite mobile platform with clock speed of 4.3GHz, 3Mn+ Antutu Score. The CPU features the first-ever 2 + 6 all-big-core architecture and an all-new 3nm process. In addition to that, it has LPDRR5X Ultra, UFS 4.1 storage, 6000mAh -3rd Generation silicon anode battery, 0.813cm ultra slim design & 120W fast charger. Also, iQOO13 is IP68+IP69 rated for dust and water resistance.\r\nGAMING: Supercomputing chip Q2, 2K + 144 Hz for lower power consumption and higher energy efficiency. Immersive Gaming Experience with 7000 mm² vapor chamber & USB 3.2.\r\nDISPLAY & DESIGN: World’s 1st Q10 2K 144Hz Ultra Eyecare Display with 6.82\" LTPO AMOLED, 1800nits HBM and 4500nits Local Peak Brightness. AI-based Automatic Brightness Adjustment. Camera modules comes with Monster Halo light for real-time notifications for calls, messages, and charging status. Legend Edition comes with iconic three-color pattern of BMW partnership.\r\nCAMERA: Flagship 50MP Sony IMX921 VCS true color camera with 32MP front camera, 4K Night Sight video @60fps.\r\nOPERATING SYSTEM: Funtouch OS 15 based on Android 15 with 4 years of Android & 5 years of security update & latest AI features.",
    "price": 54998,
    "category": "67bc4877c22bd886eecf5fa5",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741324990/bsobuwbe4mbidzqvmpcl.jpg",
    "createdAt": "2025-03-07T05:23:29.666Z",
    "__v": 0
  },
  {
    "_id": "67ca856754a7c92315b1f791",
    "title": "Apple IPhone 16",
    "description": "This pre-owned product is not Apple certified, but has been professionally inspected, tested and cleaned by Amazon-qualified suppliers.\r\nThere will be no visible cosmetic imperfections when held at an arm’s length. There will be no visible cosmetic imperfections when held at an arm’s length.\r\nThis product will have a battery which exceeds 80% capacity relative to new.\r\nAccessories will not be original, but will be compatible and fully functional. Product may come in generic Box.\r\nThis product is eligible for a replacement or refund within 90 days of receipt if you are not satisfied.",
    "price": 70198,
    "category": "67bc4877c22bd886eecf5fa5",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741325387/ooq8695j8qpngtx3cptu.jpg",
    "createdAt": "2025-03-07T05:34:31.554Z",
    "__v": 0,
    "state": "Sold"
  },
  {
    "state": "Unsold",
    "_id": "67ca856954a7c92315b1f7ce",
    "title": "OnePlus Nord 4 5G",
    "description": "108MP Triple Camera with 3x Lossless Zoom and Electronic Image Stabilisation (EIS) - titanic main camera that captures clear, high-detail photos with 9-in-1 pixel binning tech that absorbs more light for brighter, more colorful images.\r\nQualcomm Snapdragon 695 Chipset - With up to 8GB of expandable virtual RAM that will have you swiping and switching between apps at blistering speed.\r\n50W SUPERVOOC Endurance Edition + 5,000 mAh Battery - A day's power in just 30 minutes. SUPERVOOC Endurance Edition charging and Battery Health Engine technology increase the battery's lifespan and prevent over-charging.\r\n6.7” 120 Hz Display + Dual Stereo Speakers - Lose yourself in your favorite movies and shows with a massive LCD display and a speedy 120 Hz adaptive refresh rate that saves on battery + 200% Ultra Volume Mode to tune into the dual stereo speakers.\r\nOxygenOS 13.1 - Fast and Smooth experience and incredible features including Quick Start and Gaming Tools, with Game Focus Mode and improved app optimisation.\r\n5G Enabled Dual-SIM - The OnePlus Nord N30 is the perfect entry-level 5G phone, featuring premium specs and an affordable price. *5G compatible with T-mobile, Google Fi, Mint Mobile, Metro by TMO, Simple Mobile. 5G available in selected areas, please check with your carrier. (Dual-SIM is SIM & SIM/MicroSD)",
    "price": 28999,
    "category": "67bc4877c22bd886eecf5fa5",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741325525/ekggscizoanhq986moyn.jpg",
    "createdAt": "2025-03-07T05:34:33.265Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67cab83b8f4cdce5cb08735b",
    "title": "c++ ",
    "description": "best Book",
    "price": 350,
    "category": "67bc4877c22bd886eecf5fa0",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741338596/xkujqgemwqgddx7f1s0e.png",
    "createdAt": "2025-03-07T09:11:23.549Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67cbe959ebff12b638cf2bc6",
    "title": "iQOO Z9s 5G",
    "description": "[ Compatibility and Material ] - Perfectly compatible with the Vivo iQOO Z9S 5G/Vivo V40E 5G, simple luxury and clean design. Leather Case are precision made of premium PU wood grain leather, offers soft nature feel. Elegant leather texture creates a classic and luxury look.\r\n[ Practical Card Holder ] - Convenient magnetic automatic adsorption keeps your phone in safety, one card slot to hold your daily card, one transparent window for easy to view all notifications and information on your phone(Not Support Touch Control). Perfect for a more active and convenient life.\r\n[ Convenient Kickstand ] - Invisible kickstand can be switched to a horizontal position as a firm stand for reading, watching videos, browsing the web and video chatting with friends.\r\n[ Full Frame Protection ] - PU leather case and inner soft cover provides dual protection for your phone from any scratching and dirt. The shockproof TPU inner case prevents your phone from drops and bumps.\r\n[ Precise Cutouts and Holes ] - Exact cutouts to keep features fully accessible. Convenient to answer the phone without taking off the case, you can make the conversation with the case closed. Support Charging without take off the flip case.",
    "price": 19998,
    "category": "67bc4877c22bd886eecf5fa5",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741325111/dzmyx15gg3d0shhoz2js.jpg",
    "createdAt": "2025-03-08T06:53:13.800Z",
    "__v": 0
  },
  {
    "_id": "67cbeab1ebff12b638cf2cc7",
    "title": "Redmi note 10",
    "description": "WELL CONDITION",
    "price": 10000,
    "category": "67bc4877c22bd886eecf5fa5",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1741417023/rppqjatjyoa5qlbofo8u.png",
    "createdAt": "2025-03-08T06:58:57.850Z",
    "__v": 0,
    "state": "Sold"
  },
  {
    "state": "Unsold",
    "_id": "67f0e10c0ed873fd4930d66e",
    "title": "The Practicing Mind",
    "description": "Developing focus and discipline in your life. Master any skill or challenge by learning to love the process. In The Practicing Mind, Thomas Sterner demonstrates how to acquire skills for any aspect of life, be it business, parenting or sports. It has always been about trial and error and practice. If we had given up in the face of failure, repetition and difficulty, we would never have learned to walk or tie our shoes. So why, as adults, do we give up on a goal when we don't succeed at first? Sterner has an answer to this: we have forgotten the principles of practice ? the process of picking a goal and applying steady effort to reach it. The methods Sterner teaches show that proper practice isn't drudgery on the way to mastery, but in fact, a fulfilling process in and of itself, one that builds discipline and clarity. You've just got to love the process!",
    "price": 99,
    "category": "67bc4877c22bd886eecf5fa1",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1743834349/rkty1hjombwkck12tqfa.png",
    "createdAt": "2025-04-05T07:51:40.493Z",
    "__v": 0
  },
  {
    "state": "Unsold",
    "_id": "67f0efde9c9047df3363f27f",
    "title": "Sony Alpha ILCE 6100L 24.2 MP Mirrorless Digital SLR Camera",
    "description": "Real time eye AF for still + Animal Eye AF; Real time tracking\r\nWorld fastest 0.02 Sec AF speed with 425 phase detection and contrast points;24.2MP, EXMOR CMOS sensor with outstanding light sensitivity\r\n11 FPS continuous shooting with AF/AE;180 degree tilt able touch LCD screen\r\nISO sensitivity up to 102400;High resolution, sensitivity and colour reproduction capability; Smooth and stable AF; Country of Origin: China\r\nCompatible Mountings: Sony E",
    "price": 29000,
    "category": "67bc4877c22bd886eecf5faf",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1743838565/ciaotiepq0pdwmddiojm.jpg",
    "createdAt": "2025-04-05T08:54:54.114Z",
    "__v": 0
  },
  {
    "_id": "67f0faff63e22d5c96af0ec6",
    "title": "OFF LIMITS Men's STUSSYY",
    "description": "Phylon TPR sole provides traction and grip over varied surfaces\r\nMesh for Breathability and flexibilty\r\nBest recommended for running, training, any sports activity\r\nLace Up Closure make it easy to wear\r\nEVA Sockliner for comfort and cushioning.",
    "price": 1199,
    "category": "67bc4877c22bd886eecf5fb4",
    "imageURL": "https://res.cloudinary.com/dllqtlwin/image/upload/v1743845619/pblh9ib36wcabvlfgkwr.jpg",
    "state": "Unsold",
    "createdAt": "2025-04-05T09:42:23.506Z",
    "__v": 0
  }
]